import cv2   #นำเข้าไลบรารี OpenCV เพื่อใช้ในการทำงานกับภาพและวิดีโอ.

cap=cv2.VideoCapture(0)  #สร้างอ็อบเจ็กต์ VideoCapture เพื่อเปิดการใช้งานกล้องที่เชื่อมต่อกับ Raspberry Pi โดยใช้พารามิเตอร์ 0 เพื่อระบุว่าเราจะใช้กล้องแรกที่พบ

while True:
    ret, frame = cap.read()  #อ่านภาพจากกล้องและเก็บไว้ในตัวแปร frame ถ้าการอ่านสำเร็จ ret จะเป็น True.
    cv2.imshow("camera", frame)  #แสดงภาพที่อ่านได้จากกล้องในหน้าต่างที่ชื่อ "camera".
    if cv2.waitKey(1)&0xFF== ord('q'):  #รอรับอินพุตจากผู้ใช้ ถ้าผู้ใช้กดปุ่ม 'q' (โดยตรวจจับกดปุ่มผ่านรหัส ASCII ของปุ่ม 'q') จะเบรกลูป.
        break
cap.release() #ปิดการใช้งานกล้องหลังจากที่ออกจากลูป.
cv2.destroyAllWindows()  #ปิดหน้าต่างที่เปิดขึ้นโดย OpenCV.
